petermm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
    err = esp_wifi_scan_get_ap_records(&num_results, ap_records);
    if (UNLIKELY_NOT_ESP_OK(err)) {
        // the ap_list must be cleared on failures to prevent a memory leak
        esp_wifi_clear_ap_list();
        ESP_LOGE(TAG, "Failed to obtain scan results, reason: %s", esp_err_to_name(err));
        const char *error = esp_err_to_name(err);
        size_t error_len = strlen(error);

        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + error_len, heap);
        term reason = term_from_string((const uint8_t *) error, (uint16_t) error_len, &heap);
        term error_tuple = port_heap_create_tuple2(&heap, ERROR_ATOM, reason);
        term error_reply = port_heap_create_tuple2(&heap, make_atom(data->global, ATOM_STR("\xc", "scan_results")), error_tuple);
        term ref = term_from_ref_ticks(data->ref_ticks, &heap);
        term msg = port_heap_create_tuple2(&heap, ref, error_reply);
        port_send_message_from_task(data->global, term_from_local_process_id(data->owner_process_id), msg);
        END_WITH_STACK_HEAP(heap, data->global);
        free(ap_records);
        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail", esp_err_to_name(err));
        } else {
            free(data);
        }
        return;
    }
    ESP_LOGD(TAG, "Scan found %i networks", num_results);

    // return data: {scan_results, {NumberResults, [#{ssid => SSID, rssi => DBM, authmode => Mode, bssid => Bssid, chanel => ChNumber}]}}
    size_t ap_data_size = TUPLE_SIZE(2) + term_map_size_in_terms(5) + TERM_BINARY_HEAP_SIZE(SSID_MAX_SIZE) + TERM_BINARY_HEAP_SIZE(BSSID_SIZE);
    size_t results_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + LIST_SIZE(num_results, ap_data_size);
    ESP_LOGD(TAG, "Requesting size '%i' on heap for scan results", results_size);
    BEGIN_WITH_STACK_HEAP(results_size, heap);

    term networks_data_list = term_nil();
    if (num_results != 0) {
        networks_data_list = wifi_ap_records_to_list_maybe_gc(data->global, ap_records, num_results, &heap);
    }
    free(ap_records);
    term scan_results = port_heap_create_tuple2(&heap, term_from_int(num_results), networks_data_list);
    term scan_results_atom = make_atom(data->global, ATOM_STR("\xc", "scan_results"));
    term ret = port_heap_create_tuple2(&heap, scan_results_atom, scan_results);

    term ref = term_from_ref_ticks(data->ref_ticks, &heap);
    term msg = port_heap_create_tuple2(&heap, ref, ret);

    port_send_message_from_task(data->global, term_from_local_process_id(data->owner_process_id), msg);
    END_WITH_STACK_HEAP(heap, data->global);

    // If unregistering the scan done handler fails an error tuple is sent to the gen_server after
    // the scan results. This currently will fall through to the default info handler and print a
    // message on the console. A better way of handling this failure may be needed in the future.
    err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
    if (UNLIKELY_NOT_ESP_OK(err)) {
        ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail", esp_err_to_name(err));
        const char *error = esp_err_to_name(err);
        size_t error_len = strlen(error);
        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + error_len, heap);
        term reason = term_from_string((const uint8_t *) error, (uint16_t) error_len, &heap);
        term error_reply = port_heap_create_tuple2(&heap, ERROR_ATOM, reason);
        term ref = term_from_ref_ticks(data->ref_ticks, &heap);
        term msg = port_heap_create_tuple2(&heap, ref, error_reply);
        port_send_message_from_task(data->global, term_from_local_process_id(data->owner_process_id), msg);
        END_WITH_STACK_HEAP(heap, data->global);
    } else {
        free(data);
    }
}

//
// Event Handlers
//

static void event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    // TODO: Change all of the logging in event_handler to debug level, or move it to the
    // called send_* functions. We should not do any io operations inside the callback handler,
    // but debug output seems a fair trade off.
    struct ClientData *data = (struct ClientData *) arg;
    if (event_base == WIFI_EVENT) {

        switch (event_id) {

            case WIFI_EVENT_STA_START: {
                // TODO: expose an erlang callback so applications can choose how to respond to this
                // event, i.e. start a periodic scan for known networks, or initiate a connection
                ESP_LOGI(TAG, "WIFI_EVENT_STA_START received.");
                if (!data->managed) {
                    esp_wifi_connect();
                }
                break;
            }

            case WIFI_EVENT_STA_CONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_CONNECTED received.");
                send_sta_connected(data);
                break;
            }

            case WIFI_EVENT_STA_DISCONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_DISCONNECTED received.");
                send_sta_disconnected(data);
                break;
            }

            case WIFI_EVENT_AP_STACONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_STACONNECTED received.");
                wifi_event_ap_staconnected_t *event = (wifi_event_ap_staconnected_t *) event_data;
                send_ap_sta_connected(data, event->mac);
                break;
            }

            case WIFI_EVENT_AP_STADISCONNECTED: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_STADISCONNECTED received.");
                wifi_event_ap_stadisconnected_t *event = (wifi_event_ap_stadisconnected_t *) event_data;
                send_ap_sta_disconnected(data, event->mac);
                break;
            }

            case WIFI_EVENT_AP_START: {
                ESP_LOGI(TAG, "WIFI_EVENT_AP_START received.");
                send_ap_started(data);
                break;
            }

#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0))
            case WIFI_EVENT_HOME_CHANNEL_CHANGE: {
                wifi_event_home_channel_change_t *chan_data = (wifi_event_home_channel_change_t *) event_data;
                ESP_LOGD(TAG, "WIFI_EVENT home channel changed from %u to %u.", chan_data->old_chan, chan_data->new_chan);
                break;
            }
#endif

            case WIFI_EVENT_STA_BEACON_TIMEOUT: {
                ESP_LOGI(TAG, "WIFI_EVENT_STA_BEACON_TIMEOUT received. Maybe poor signal, or network congestion?");
                send_sta_beacon_timeout(data);
                break;
            }

            case WIFI_EVENT_SCAN_DONE: {
                ESP_LOGD(TAG, "WiFI network scan complete.");
                // Assure this wont be optimized away (if logging is disabled or lower than debug), so that
                // the gen_server doesn't receive spurious "Unhandled wifi event: 1" messages. The real handler
                // (scan_done_handler) is registered and unregistered per request. We catch this here so that
                // we can subscribe to all wifi events in network_start, otherwise each event needs to be
                // subscribed and unsubscribed individually.
                asm("nop");
                break;
            }

            default:
                ESP_LOGI(TAG, "Unhandled wifi event: %" PRIi32 ".", event_id);
                break;
        }

    } else if (event_base == IP_EVENT) {

        switch (event_id) {

