petermm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
static void sta_disconnect(Context *ctx, term pid, term ref)
{
    esp_err_t err = esp_wifi_disconnect();
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "Error while disconnecting from AP (%i)", err);
        port_ensure_available(ctx, PORT_REPLY_SIZE + TUPLE_SIZE(2));
        term error = port_create_error_tuple(ctx, term_from_int(err));
        port_send_reply(ctx, pid, ref, error);
        return;
    }

    size_t heap_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);
    if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "Unable to allocate heap space for sta_disconnect; no message sent");
        return;
    }

    port_send_reply(ctx, pid, ref, OK_ATOM);
}

static void sta_connect(Context *ctx, term pid, term ref, term config)
{
    size_t tuple_reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);

    //
    // Check wifi mode
    //
    wifi_mode_t mode;
    esp_err_t err = esp_wifi_get_mode(&mode);
    if ((err != ESP_OK) || ((mode != WIFI_MODE_STA) && (mode != WIFI_MODE_APSTA))) {
        ESP_LOGE(TAG, "sta_connect: WiFi mode must be started in either STA mode or APSTA mode to use this function");
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, ERROR_ATOM);
        port_send_reply(ctx, pid, ref, error);
        return;
    }

    //
    // Get the STA config
    //
    term sta_config = interop_kv_get_value_default(config, sta_atom, term_invalid_term(), ctx->global);
    if (UNLIKELY(term_is_invalid_term(sta_config))) {
        // Also accept a proplist containing `ssid` and `psk` key/value tuples.
        if ((interop_kv_get_value_default(config, ssid_atom, term_invalid_term(), ctx->global)) != (term_invalid_term())) {
            sta_config = config;
        } else {
            ESP_LOGE(TAG, "Expected STA configuration but got none");
            port_ensure_available(ctx, tuple_reply_size);
            term error = port_create_error_tuple(ctx, BADARG_ATOM);
            port_send_reply(ctx, pid, ref, error);
            return;
        }
    }

    wifi_config_t *sta_wifi_config = get_sta_wifi_config(sta_config, ctx->global);
    if (IS_NULL_PTR(sta_wifi_config)) {
        ESP_LOGE(TAG, "Unable to get STA configuration");
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, BADARG_ATOM);
        port_send_reply(ctx, pid, ref, error);
        return;
    }

    //
    // Set up STA mode
    //
    if ((err = esp_wifi_set_config(ESP_IF_WIFI_STA, sta_wifi_config)) != ESP_OK) {
        ESP_LOGE(TAG, "Error setting STA mode config %d", err);
        free(sta_wifi_config);
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, term_from_int(err));
        port_send_reply(ctx, pid, ref, error);
        return;
    } else {
        ESP_LOGD(TAG, "STA mode configured");
        free(sta_wifi_config);
    }

    //
    // Set the DHCP hostname
    //
    esp_netif_t *sta_interface = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    set_dhcp_hostname(sta_interface, "STA", interop_kv_get_value(sta_config, dhcp_hostname_atom, ctx->global));

    if ((err = esp_wifi_connect()) != ESP_OK) {
        ESP_LOGE(TAG, "Error while connecting: %d", err);
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, term_from_int(err));
        port_send_reply(ctx, pid, ref, error);
        return;
    } else {
        ESP_LOGI(TAG, "WiFi connection started.");
    }

    //
    // Set up simple NTP, if configured
    //
    maybe_set_sntp(interop_kv_get_value(config, sntp_atom, ctx->global), ctx->global);

    if (UNLIKELY(memory_ensure_free(ctx, tuple_reply_size) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "Unable to allocate heap space for sta_connect/1; no message sent");
        return;
    }
    port_send_reply(ctx, pid, ref, OK_ATOM);
}

static void sta_reconnect(Context *ctx, term pid, term ref)
{
    size_t tuple_reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);

    esp_err_t err = esp_wifi_connect();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error while connecting: %d", err);
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, term_from_int(err));
        port_send_reply(ctx, pid, ref, error);
        return;
    } else {
        ESP_LOGI(TAG, "WiFi connection started.");
    }

    if (UNLIKELY(memory_ensure_free(ctx, tuple_reply_size) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "Unable to allocate heap space for sta_connect/0; no message sent");
        return;
    }
    port_send_reply(ctx, pid, ref, OK_ATOM);
}

static void wifi_scan(Context *ctx, term pid, term ref, term config)
{
    wifi_mode_t mode;
    esp_err_t err = esp_wifi_get_mode(&mode);
    if ((err != ESP_OK) || ((mode != WIFI_MODE_STA) && (mode != WIFI_MODE_APSTA))) {
        ESP_LOGE(TAG, "WiFi must already be configured in STA or AP+STA mode to use network:wifi_scan/0,1");
        term reason = make_atom(ctx->global, ATOM_STR("\x10", "unsupported_mode"));
        send_scan_error_reason(ctx, pid, ref, reason);
        return;
    }

    term cfg_results = interop_kv_get_value_default(config, ATOM_STR("\x7", "results"), term_from_int(DEFAULT_SCAN_RESULT_MAX), ctx->global);
    if (UNLIKELY(!term_is_integer(cfg_results))) {
        ESP_LOGE(TAG, "results option must be an integer (i.e. {results, 6})");
        send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
        return;
    }

    uint16_t num_results = (uint16_t) term_to_int(cfg_results);

    if (UNLIKELY((num_results < 1) || (num_results > MAX_SCAN_RESULTS))) {
        ESP_LOGE(TAG, "results option must be between 1 and %i on this platform.", MAX_SCAN_RESULTS);
        send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
        return;
    } else {
        ESP_LOGD(TAG, "Scan will return a maximum of %u results", num_results);
    }

    term term_passive = interop_kv_get_value_default(config, ATOM_STR("\x7", "passive"), term_invalid_term(), ctx->global);
    bool active_scan = true;
    if ((!term_is_invalid_term(term_passive)) && (term_passive == TRUE_ATOM)) {
        active_scan = false;
    }

    term cfg_dwell = interop_kv_get_value_default(config, ATOM_STR("\x5", "dwell"), term_invalid_term(), ctx->global);
    uint32_t dwell_ms = 0;
    if (cfg_dwell == term_invalid_term()) {
        if (active_scan == true) {
            dwell_ms = IDF_DEFAULT_ACTIVE_SCAN_TIME;
        } else {
            dwell_ms = IDF_DEFAULT_PASSIVE_SCAN_TIME;
        }
    } else {
        if (UNLIKELY(!term_is_integer(cfg_dwell))) {
            ESP_LOGE(TAG, "Channel dwell time milliseconds must be an integer (i.e. {dwell, 250})");
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        }
        dwell_ms = (uint32_t) term_to_int(cfg_dwell);
        if (UNLIKELY((dwell_ms < 1lu) || (dwell_ms > 1500lu))) {
            ESP_LOGE(TAG, "Per channel dwell time milliseconds must be {dwell, 1..1500}");
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        } else {
            ESP_LOGD(TAG, "Scan will spend %lu ms per channel", dwell_ms);
        }
    }

    term term_hidden = interop_kv_get_value_default(config, ATOM_STR("\xB", "show_hidden"), term_invalid_term(), ctx->global);
    bool show_hidden = false;
    if ((!term_is_invalid_term(term_hidden)) && (term_hidden == TRUE_ATOM)) {
        show_hidden = true;
    }

    wifi_scan_type_t scan_type = WIFI_SCAN_TYPE_ACTIVE;
    switch (active_scan) {
        case false:
            scan_type = WIFI_SCAN_TYPE_PASSIVE;
            break;
        case true:
            break;
    }

    wifi_scan_config_t *scan_config = (wifi_scan_config_t *) calloc(1, sizeof(wifi_scan_config_t));
    if (IS_NULL_PTR(scan_config)) {
        ESP_LOGE(TAG, "Unable to allocate memory for configuration");
        send_scan_error_reason(ctx, pid, ref, OUT_OF_MEMORY_ATOM);
        return;
    }

    if (scan_type == WIFI_SCAN_TYPE_ACTIVE) {
        scan_config->scan_time.active.max = dwell_ms;
        // For fast scans use the same min time as max (like ESP-IDF default), but for longer
        // per-channel dwell times set the min scan time to 1/2 of the maximum, but never less
        // than the 120ms min used in the default scan.
        if (dwell_ms > IDF_DEFAULT_ACTIVE_SCAN_TIME * 2) {
            scan_config->scan_time.active.min = (dwell_ms / 2);
        } else {
            scan_config->scan_time.active.min = dwell_ms;
        }
    } else {
        scan_config->scan_time.passive = dwell_ms;
        if (dwell_ms > 1000) {
            // Increase home channel dwell between scanning consecutive channel from 30 to 60ms to prevent beacon timeouts
            scan_config->home_chan_dwell_time = 60;
        }
    }

    scan_config->show_hidden = show_hidden;
    scan_config->scan_type = scan_type;

    struct ScanClientData *data = malloc(sizeof(struct ScanClientData));
    if (IS_NULL_PTR(data)) {
        ESP_LOGE(TAG, "Failed to allocate ClientData");
        send_scan_error_reason(ctx, pid, ref, OUT_OF_MEMORY_ATOM);
        free(scan_config);
        return;
    }
    data->global = ctx->global;
    data->owner_process_id = term_to_local_process_id(pid);
    data->ref_ticks = term_to_ref_ticks(ref);
    data->num_results = num_results;

